<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"80e92622c1b08eac7421abfa275c48c5c1524cee6ee815c67b162801de5fdf2f","plan_job_ref":"Job .github/workflows/_test-tf.yaml #202 at https://github.com/tx-pts-dai/github-workflows/actions/runs/11363125607","plan_out_hash":"5c539a3b2dee7dc92fd40039396cbeb11a74a646e0189e842ebbe11f5592676f","plan_hash":"b66cbd4da6e23c43cd5bc25bdc15bc3617c2d7189f209f01ba651881869118e6","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #202](https://github.com/tx-pts-dai/github-workflows/actions/runs/11363125607)